haivivi/embed-zig/examples/esp/http_speed_test/c/sdkconfig.defaults
# ESP32-S3-DevKitC-1 with PSRAM
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_2MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# CPU Frequency 240MHz
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_240=y
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_MHZ=240

# Run code from PSRAM (reduces IRAM usage)
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y

# Compiler optimizations
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# WiFi
CONFIG_WIFI_SSID="HAIVIVI-MFG"
CONFIG_WIFI_PASSWORD="!haivivi"

# Test Server
CONFIG_TEST_SERVER_IP="192.168.4.221"
CONFIG_TEST_SERVER_PORT=8080

# HTTP Client
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=y
CONFIG_ESP_HTTP_CLIENT_ENABLE_BASIC_AUTH=n

# mbedTLS CA bundle for HTTPS
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# TLS configuration
CONFIG_MBEDTLS_SSL_MAX_CONTENT_LEN=16384
CONFIG_MBEDTLS_ASYMMETRIC_CONTENT_LEN=y
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=16384
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=4096

# Disable unused
CONFIG_BT_ENABLED=n

# Increase task stack for HTTP
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# ============================================================================
# WiFi Optimizations for Speed
# ============================================================================
# Use PSRAM for WiFi/LWIP buffers (reduces internal RAM pressure)
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# WiFi RX buffers
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=64

# WiFi TX buffers  
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=64

# WiFi AMPDU settings (increase TX window for better throughput)
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=y
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=y
CONFIG_ESP_WIFI_TX_BA_WIN=16
CONFIG_ESP_WIFI_RX_BA_WIN=16

# Disable power management for max throughput
CONFIG_ESP_WIFI_STA_DISCONNECTED_PM_ENABLE=n

# Cache TX buffers in PSRAM
CONFIG_ESP_WIFI_CACHE_TX_BUFFER_NUM=32

# ============================================================================
# LWIP TCP Optimizations for Speed
# ============================================================================
# Increase TCP window size for higher throughput
CONFIG_LWIP_TCP_WND_DEFAULT=32768
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=32768
CONFIG_LWIP_TCP_RECVMBOX_SIZE=32
# MSS
CONFIG_LWIP_TCP_MSS=1440
# Disable Nagle (faster small packets)
CONFIG_LWIP_TCP_NODELAY=y
# SO_REUSE
CONFIG_LWIP_SO_REUSE=y
